# Sigma rule that detects LLMNR queries in your environment
title: LLMNR Multicast Query Detected
id: 82eba565-d3d6-4227-8f01-456b21100293
status: experimental
description: Detects LLMNR multicast queries on UDP port 5355.
author: Robert Onyango
logsource:
  product: suricata
  service: ids
detection:
  selection:
    signature_id: 100001
  condition: selection
fields:
  - src_ip
  - dest_ip
falsepositives:
  - Normal LLMNR usage (printers, file shares)
level: high
tags:
  - attack.discovery
  - attack.t1557.001