# Sigma coorelation rule for Suricata alert logs: If LLMNR (id = 100001) and SMB rogue (id = 100002) happen within 5 minutes for the same src_ip -> raise correlation alert. The first two rules extract the alerts of the Suricata rules (LLMNR and SMB) by their IDs.
# NOTE: Elastalert backend does not support multiple corelation rules as the one below. Look at it for practise purposes and adoption to other pipelines as needs be.

title: LLMNR Multicast Query Detected
id: 82eba565-d3d6-4227-8f01-456b21100293
status: experimental
description: Detects LLMNR multicast queries on UDP port 5355.
author: Robert Onyango
logsource:
  product: suricata
  service: alert
detection:
  selection:
    rule.id: 100001 # LLMNR suricata rule ID
  condition: selection
fields:
  - source_ip
  - destination_ip
falsepositives:
  - Normal LLMNR usage (printers, file shares)
level: high
tags:
  - attack.discovery
  - attack.t1557.001
---
title: SMB Connection to Non-DC Host
id: 7bd2c1bc-5574-44be-9d6b-4ef2a6fd49b7
status: experimental
description: Detects SMB sessions to non-DC hosts, possible rogue server.
author: Robert Onyango
logsource:
  product: suricata
  service: alert
detection:
  selection:
    rule.id: 100002 # SMB suricata rule ID
  condition: selection
fields:
  - source_ip  
  - destination_ip
falsepositives:
  - SMB access to legitimate file servers
level: medium
tags:
  - attack.t1557.001
--- 
title: LLMNR Poisoning with SMB Authentication Attempt
id: 657727c5-5e58-45c0-946b-53b75411d762
status: experimental
description: Correlates LLMNR multicast queries followed by SMB connections to non-DC hosts.
author: Robert Onyango
correlation:
  type: temporal
  rules:
    - 82eba565-d3d6-4227-8f01-456b21100293
    - 7bd2c1bc-5574-44be-9d6b-4ef2a6fd49b7
  group-by:
    - source_ip
  timespan: 5m
level: high
tags:
  - attack.t1557.001