title: Suspicious NTLM Logons
description: Detect successful logons from devices only on NTLM without any Kerberos associated with the Source IP
id: ab1cafa7-250a-4123-aff6-aefac1533dbc
status: test
logsource:
  product: windows
  service: security
detection:
  selection1:
    EventCode: 4624
    Logon: 3
    Authentication_Package: NTLM
  selection2:
    Authentication_Package: Kerberos
  condition: selection1 and not selection2
level: high
